app/Controllers/Admin.php

    public function InicioAdmin()
    {
        $modelusuario = model('Model_Login');
        $totalusuarios = $modelusuario->countAll();
        $usuariosactivos = $modelusuario->usuariosactivos();
        $usuariosinactivos = $modelusuario->usuariosinactivos();

        $modelregion = model('Model_Region');
        $totalregiones = $modelregion->countAll();
        $regionactivos = $modelregion->regionactivos();
        $regioninactivos = $modelregion->regioninactivos();

        $modelsubregion = model('Model_SubRegion');
        $totalsubregiones = $modelsubregion->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `reg_region`
SELECT COUNT(*) AS `numrows` FROM `sre_sub_region`