app/Controllers/Admin.php

SELECT *
FROM `scu_sub_cuenta`
SELECT *
FROM `cue_cuenta`
SELECT *
FROM `ccs_catalogo_codigo_sicoin`
SELECT *
FROM `tge_tipo_gestion`
SELECT *
FROM `etr_estado_transaccion`
SELECT *
FROM `eac_estado_activo`
SELECT *
FROM `sre_sub_region`
SELECT *
FROM `reg_region`
SELECT *
FROM `dep_departamento`
SELECT *
FROM `car_cargo`
---
    public function Administrar()
    {
        //LISTADO DE SUBCUENTA
        $modelsubcuenta = model('Model_SubCuenta');
        $subcuentas = $modelsubcuenta->findAll();
        //LISTADO DE CUENTA
        $modelcuenta = model('Model_Cuenta');
        $cuentas = $modelcuenta->findAll();
        //LISTADO DE CATALOGO CODIGO SICOIN
        $modelcatalogo = model('Model_CatalogoCodigoSicoin');
        $catalogossicoin = $modelcatalogo->findAll();
        //LISTADO TIPO DE GESTION
        $modeltipogestion = model('Model_TipoGestion');
        $tipogestiones = $modeltipogestion->findAll();
        //LISTADO ESTADO TRANSACCION
        $modelestadotransaccion = model('Model_EstadoTransaccion');
        $estadotransacciones = $modelestadotransaccion->findAll();
        //LISTADO ESTADO ACTIVO
        $modelestadoactivo = model('Model_EstadoActivo');
        $estadoactivos = $modelestadoactivo->findAll();
        //LISTADO SUBREGIONES
        $modelsubregion = model('Model_SubRegion');
        $subregiones = $modelsubregion->findAll();
        //LISTADO REGIONES
        $modelregion = model('Model_Region');
        $regiones = $modelregion->findAll();

        //LISTADO PARA USUARIOS
        $modeldep = model('Model_Departamento');
        $departamentos = $modeldep->findAll();

        $modelcar = model('Model_Cargo');
        $cargos = $modelcar->findAll();

INSERT INTO `scu_sub_cuenta` (`scu_nombre`, `scu_idcue`, `scu_estado`) VALUES ('Cocalitos', '1', '1')
---
    public function registrarsubcuenta()
    {
        // Inserta el usuario en la base de datos
        $modelsubcuenta = model('Model_SubCuenta'); // Asegúrate de tener un modelo de usuarios
        $userData = [
            'scu_nombre' => $this->request->getPost('scu_nombre'),
            'scu_idcue' => $this->request->getPost('scu_idcue'),
            'scu_estado' => $this->request->getPost('scu_estado')
        ];
        $response = $modelsubcuenta->insert($userData);