app/Controllers/Compras.php

    public function ListarComprar(){

        $modeltraComprasact = model('Model_TransaccionCompraActivo');
        $listadotcaact = $modeltraComprasact->Listadotcaact();

        $modelCompras = model('model_compras');
        $listaesperas = $modelCompras->ListadoEspera();
        $listacompras = $modelCompras->findAll();

        $estTransaccion = model('model_estadoTrans');
        $est_transaccion = $estTransaccion->findAll();

        $modelactivo = model('Model_Activo');
        $listadoactivos = $modelactivo->findAll();
---
SELECT *
FROM `act_activo`