app/Models/Model_Activo.php

SELECT *
FROM `act_activo`
---
    public function ListadoActivosEstados(){
        $builder = $this->builder();
        $result = $builder->get();