app/Models/model_compras.php

    public function ListadotcotcaactiacRechazadas(){
        $builder = $this->builder();
        $builder->join('tca_transaccion_compra_activo', 'tco_transaccion_compra.tco_id = tca_transaccion_compra_activo.tca_idtco');
        $builder->join('act_activo', 'tca_transaccion_compra_activo.tca_idact = act_activo.act_id');
        $builder->join('etr_estado_transaccion', 'etr_estado_transaccion.etr_id = tco_transaccion_compra.tco_idetr');
        $builder->where('etr_estado_transaccion.etr_nombre', 'Rechazada');
        $result = $builder->get();
---
SELECT *
FROM `tco_transaccion_compra`
JOIN `tca_transaccion_compra_activo` ON `tco_transaccion_compra`.`tco_id` = `tca_transaccion_compra_activo`.`tca_idtco`
JOIN `act_activo` ON `tca_transaccion_compra_activo`.`tca_idact` = `act_activo`.`act_id`
JOIN `etr_estado_transaccion` ON `etr_estado_transaccion`.`etr_id` = `tco_transaccion_compra`.`tco_idetr`
WHERE `etr_estado_transaccion`.`etr_nombre` = 'Rechazada'

    public function ListadotcotcaactiacAprobadas(){
        $builder = $this->builder();
        $builder->join('tca_transaccion_compra_activo', 'tco_transaccion_compra.tco_id = tca_transaccion_compra_activo.tca_idtco');
        $builder->join('act_activo', 'tca_transaccion_compra_activo.tca_idact = act_activo.act_id');
        $builder->join('etr_estado_transaccion', 'etr_estado_transaccion.etr_id = tco_transaccion_compra.tco_idetr');
        $builder->join('iac_inventario_activov2', 'iac_inventario_activov2.iac_idtca = tca_transaccion_compra_activo.tca_id');
        $builder->join('scu_sub_cuenta', 'iac_inventario_activov2.iac_idscu  = scu_sub_cuenta.scu_id');
        $builder->join('cue_cuenta', 'scu_sub_cuenta.scu_idcue   = cue_cuenta.cue_id');
        $builder->where('etr_estado_transaccion.etr_nombre', 'Aprobada');
        $result = $builder->get();
---
SELECT *
FROM `tco_transaccion_compra`
JOIN `tca_transaccion_compra_activo` ON `tco_transaccion_compra`.`tco_id` = `tca_transaccion_compra_activo`.`tca_idtco`
JOIN `act_activo` ON `tca_transaccion_compra_activo`.`tca_idact` = `act_activo`.`act_id`
JOIN `etr_estado_transaccion` ON `etr_estado_transaccion`.`etr_id` = `tco_transaccion_compra`.`tco_idetr`
JOIN `iac_inventario_activov2` ON `iac_inventario_activov2`.`iac_idtca` = `tca_transaccion_compra_activo`.`tca_id`
JOIN `scu_sub_cuenta` ON `iac_inventario_activov2`.`iac_idscu`  = `scu_sub_cuenta`.`scu_id`
JOIN `cue_cuenta` ON `scu_sub_cuenta`.`scu_idcue`   = `cue_cuenta`.`cue_id`
WHERE `etr_estado_transaccion`.`etr_nombre` = 'Aprobada'

    public function ListadotcotcaactiacPendientes(){
        $builder = $this->builder();
        $builder->join('tca_transaccion_compra_activo', 'tco_transaccion_compra.tco_id = tca_transaccion_compra_activo.tca_idtco');
        $builder->join('act_activo', 'tca_transaccion_compra_activo.tca_idact = act_activo.act_id');
        $builder->join('etr_estado_transaccion', 'etr_estado_transaccion.etr_id = tco_transaccion_compra.tco_idetr');
        $builder->where('etr_estado_transaccion.etr_nombre', 'Pendiente');
        $result = $builder->get();
---
SELECT *
FROM `tco_transaccion_compra`
JOIN `tca_transaccion_compra_activo` ON `tco_transaccion_compra`.`tco_id` = `tca_transaccion_compra_activo`.`tca_idtco`
JOIN `act_activo` ON `tca_transaccion_compra_activo`.`tca_idact` = `act_activo`.`act_id`
JOIN `etr_estado_transaccion` ON `etr_estado_transaccion`.`etr_id` = `tco_transaccion_compra`.`tco_idetr`
WHERE `etr_estado_transaccion`.`etr_nombre` = 'Pendiente'