app/Models/Model_TransaccionCompraActivo.php

    public function Listadotcaact(){
        $builder = $this->builder();
        $builder->join('tco_transaccion_compra', 'tco_transaccion_compra.tco_id  = tca_transaccion_compra_activo.tca_idtco');
        $builder->join('act_activo', 'act_activo.act_id = tca_transaccion_compra_activo.tca_idact');
        $result = $builder->get();
---
SELECT *
FROM `tca_transaccion_compra_activo`
JOIN `tco_transaccion_compra` ON `tco_transaccion_compra`.`tco_id`  = `tca_transaccion_compra_activo`.`tca_idtco`
JOIN `act_activo` ON `act_activo`.`act_id` = `tca_transaccion_compra_activo`.`tca_idact`