app/Models/Model_Gestion.php

SELECT *
FROM `ges_gestion`
JOIN `tge_tipo_gestion` ON `tge_tipo_gestion`.`tge_id` = `ges_gestion`.`ges_idtge`
---
    public function ListadoGestiones(){
        $builder = $this->builder();
        $builder->join('tge_tipo_gestion', 'tge_tipo_gestion.tge_id = ges_gestion.ges_idtge');
        $result = $builder->get();