app/Models/Model_EstadoTransaccion.php

    public function desactivarestadotransaccion($estadotransaccionData, $etr_id){
        return $this->update($etr_id, $estadotransaccionData);
---
UPDATE `etr_estado_transaccion` SET `etr_estado` = 0
WHERE `etr_estado_transaccion`.`etr_id` IN ('3')