app/Models/Model_Activo_Gestion.php

SELECT *
FROM `age_activo_gestion`
JOIN `act_activo` ON `act_activo`.`act_id` = `age_activo_gestion`.`age_idact`
JOIN `ges_gestion` ON `ges_gestion`.`ges_id` = `age_activo_gestion`.`age_idges`
JOIN `tge_tipo_gestion` ON `tge_tipo_gestion`.`tge_id` = `ges_gestion`.`ges_idtge`
---
    public function ListadoMovimientosActivos(){
        $builder = $this->builder();
        $builder->join('act_activo', 'act_activo.act_id = age_activo_gestion.age_idact');
        $builder->join('ges_gestion', 'ges_gestion.ges_id = age_activo_gestion.age_idges');
        $builder->join('tge_tipo_gestion', 'tge_tipo_gestion.tge_id = ges_gestion.ges_idtge');
        $result = $builder->get();