app/Models/Model_Cuenta.php

SELECT *
FROM `cue_cuenta`
---
    public function ListadoCuenta(){
        $builder = $this->builder();
        $result = $builder->get();