app/Models/Model_SubCuenta.php

SELECT *
FROM `scu_sub_cuenta`
JOIN `cue_cuenta` ON `scu_sub_cuenta`.`scu_idcue`   = `cue_cuenta`.`cue_id`
---
    public function ListadoSubCuenta(){
        $builder = $this->builder();
        $builder->join('cue_cuenta', 'scu_sub_cuenta.scu_idcue   = cue_cuenta.cue_id');
        $result = $builder->get();