app/Models/Model_Region.php

    public function regionactivos(){
        return $this->where('reg_estado', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `reg_region`
WHERE `reg_estado` = 1

    public function regioninactivos(){
        return $this->where('reg_estado', 0)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `reg_region`
WHERE `reg_estado` = 0