app/Models/Model_SubRegion.php

SELECT COUNT(*) AS `numrows`
FROM `sre_sub_region`
WHERE `sre_estado` = 1
---
    public function subregionactivos(){
        return $this->where('sre_estado', 1)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `sre_sub_region`
WHERE `sre_estado` = 0
---
    public function subregioninactivos(){
        return $this->where('sre_estado', 0)->countAllResults();