app/Models/Model_Login.php

SELECT *
FROM `per_personal`
WHERE `per_correo` = 'eduardo@gmail.com'
 LIMIT 1
---
    function ValidarUsuario($per_correo, $per_contrasena){
        $db = \Config\Database::connect();
    $session = \Config\Services::session();
    $per_id = $session->get('per_id');
    $builder = $db->table('per_personal');


    $builder->select('*');
    //$builder->join('mark_tbl', 'mark_tbl.sub_id = subject_tbl.sub_id');
    $builder->where('per_correo', $per_correo);
    $builder->where('per_contrasena', $per_contrasena);
    $query = $builder->get();